In [51]:
import numpy as np
import pandas as pd

##1. Create a sample JSON object from titanic dataset

https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv

In [52]:
csvObj = pd.read_csv('https://raw.githubusercontent.com/pcsanwald/kaggle-titanic/master/train.csv')
csvObj.head()
#type(csvObj)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [53]:

jsonObj = csvObj.head(20).to_json()
jsonObj
#type(jsonObj)

'{"survived":{"0":0,"1":1,"2":1,"3":1,"4":0,"5":0,"6":0,"7":0,"8":1,"9":1,"10":1,"11":1,"12":0,"13":0,"14":0,"15":1,"16":0,"17":1,"18":0,"19":1},"pclass":{"0":3,"1":1,"2":3,"3":1,"4":3,"5":3,"6":1,"7":3,"8":3,"9":2,"10":3,"11":1,"12":3,"13":3,"14":3,"15":2,"16":3,"17":2,"18":3,"19":3},"name":{"0":"Braund, Mr. Owen Harris","1":"Cumings, Mrs. John Bradley (Florence Briggs Thayer)","2":"Heikkinen, Miss. Laina","3":"Futrelle, Mrs. Jacques Heath (Lily May Peel)","4":"Allen, Mr. William Henry","5":"Moran, Mr. James","6":"McCarthy, Mr. Timothy J","7":"Palsson, Master. Gosta Leonard","8":"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)","9":"Nasser, Mrs. Nicholas (Adele Achem)","10":"Sandstrom, Miss. Marguerite Rut","11":"Bonnell, Miss. Elizabeth","12":"Saundercock, Mr. William Henry","13":"Andersson, Mr. Anders Johan","14":"Vestrom, Miss. Hulda Amanda Adolfina","15":"Hewlett, Mrs. (Mary D Kingcome) ","16":"Rice, Master. Eugene","17":"Williams, Mr. Charles Eugene","18":"Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)","19":"Masselmani, Mrs. Fatima"},"sex":{"0":"male","1":"female","2":"female","3":"female","4":"male","5":"male","6":"male","7":"male","8":"female","9":"female","10":"female","11":"female","12":"male","13":"male","14":"female","15":"female","16":"male","17":"male","18":"female","19":"female"},"age":{"0":22.0,"1":38.0,"2":26.0,"3":35.0,"4":35.0,"5":null,"6":54.0,"7":2.0,"8":27.0,"9":14.0,"10":4.0,"11":58.0,"12":20.0,"13":39.0,"14":14.0,"15":55.0,"16":2.0,"17":null,"18":31.0,"19":null},"sibsp":{"0":1,"1":1,"2":0,"3":1,"4":0,"5":0,"6":0,"7":3,"8":0,"9":1,"10":1,"11":0,"12":0,"13":1,"14":0,"15":0,"16":4,"17":0,"18":1,"19":0},"parch":{"0":0,"1":0,"2":0,"3":0,"4":0,"5":0,"6":0,"7":1,"8":2,"9":0,"10":1,"11":0,"12":0,"13":5,"14":0,"15":0,"16":1,"17":0,"18":0,"19":0},"ticket":{"0":"A\\/5 21171","1":"PC 17599","2":"STON\\/O2. 3101282","3":"113803","4":"373450","5":"330877","6":"17463","7":"349909","8":"347742","9":"237736","10":"PP 9549","11":"113783","12":"A\\/5. 2151","13":"347082","14":"350406","15":"248706","16":"382652","17":"244373","18":"345763","19":"2649"},"fare":{"0":7.25,"1":71.2833,"2":7.925,"3":53.1,"4":8.05,"5":8.4583,"6":51.8625,"7":21.075,"8":11.1333,"9":30.0708,"10":16.7,"11":26.55,"12":8.05,"13":31.275,"14":7.8542,"15":16.0,"16":29.125,"17":13.0,"18":18.0,"19":7.225},"cabin":{"0":null,"1":"C85","2":null,"3":"C123","4":null,"5":null,"6":"E46","7":null,"8":null,"9":null,"10":"G6","11":"C103","12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null},"embarked":{"0":"S","1":"C","2":"S","3":"S","4":"S","5":"Q","6":"S","7":"S","8":"S","9":"C","10":"S","11":"S","12":"S","13":"S","14":"S","15":"S","16":"Q","17":"S","18":"S","19":"C"}}'

# Read the JSON object and convert it to pandas data frame

In [55]:
df = pd.read_json(jsonObj)
df.head()

,age,cabin,embarked,fare,name,parch,pclass,sex,sibsp,survived,ticket
0,22.0,None,S,7.2500,"Braund, Mr. Owen Harris",0,3,male,1,0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,1,female,1,1,PC 17599
10,4.0,G6,S,16.7000,"Sandstrom, Miss. Marguerite Rut",1,3,female,1,1,PP 9549
11,58.0,C103,S,26.5500,"Bonnell, Miss. Elizabeth",0,1,female,0,1,113783
12,20.0,None,S,8.0500,"Saundercock, Mr. William Henry",0,3,male,0,0,A/5. 2151

## match the top 5 records from JSON read and actual titanic dataset

In [57]:
csvObj.head().isin(df.head())

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,True,True,True,True,True,True,True,True,True,False,True
1,True,True,True,True,True,True,True,True,True,True,True
2,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False

## 2. read the HTML file as given below
http://vincentarelbundock.github.io/Rdatasets/datasets.html

In [58]:
htmlDataset = pd.read_html('http://vincentarelbundock.github.io/Rdatasets/datasets.html',header=0)
#htmlDataset[1]

## create a data frame from the above object

In [59]:
htmlDf = pd.DataFrame(htmlDataset[1])
htmlDf.head(10)

,Package,Item,Title,Rows,Cols,CSV,Doc
0,boot,acme,Monthly Excess Returns,60,3,CSV,DOC
1,boot,aids,Delay in AIDS Reporting in England and Wales,570,6,CSV,DOC
2,boot,aircondit,Failures of Air-conditioning Equipment,12,1,CSV,DOC
3,boot,aircondit7,Failures of Air-conditioning Equipment,24,1,CSV,DOC
4,boot,amis,Car Speeding and Warning Signs,8437,4,CSV,DOC
5,boot,aml,Remission Times for Acute Myelogenous Leukaemia,23,3,CSV,DOC
6,boot,beaver,Beaver Body Temperature Data,100,4,CSV,DOC
7,boot,bigcity,Population of U.S. Cities,49,2,CSV,DOC
8,boot,brambles,Spatial Location of Bramble Canes,823,3,CSV,DOC
9,boot,breslow,Smoking Deaths Among Doctors,10,5,CSV,DOC

## Create URL to JSON file (alternatively this can be a filepath)

In [60]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/data.json'
jdf = pd.read_json(url,orient='columns')
jdf.head()

    category            datetime  integer
0          0 2015-01-01 00:00:00        5
1          0 2015-01-01 00:00:01        5
10         0 2015-01-01 00:00:10        5
11         0 2015-01-01 00:00:11        5
12         0 2015-01-01 00:00:12        8